glennrub/micropython/ports/nrf/boards/pca20035/mpconfigboard.h
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2019 Glenn Ruben Bakke
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#define PCA20035

#define MICROPY_HW_BOARD_NAME       "PCA20035"
#define MICROPY_HW_MCU_NAME         "NRF9160"
#define MICROPY_PY_SYS_PLATFORM     "nrf9160"

#define MICROPY_PY_MACHINE_UART     (1)
#define MICROPY_PY_MACHINE_HW_PWM   (0)
#define MICROPY_PY_MACHINE_HW_SPI   (1)
#define MICROPY_PY_MACHINE_TIMER    (0)
#define MICROPY_PY_MACHINE_RTCOUNTER (0)
#define MICROPY_PY_MACHINE_I2C      (1)
#define MICROPY_PY_MACHINE_ADC      (0)
#define MICROPY_PY_MACHINE_TEMP     (0)
#define MICROPY_PY_RANDOM_HW_RNG    (0)

#define MICROPY_MBFS                (0)
#define MICROPY_SECURITY_FS         (1)
#define MICROPY_VFS                 (1)

#define MICROPY_HW_HAS_LED          (1)
#define MICROPY_HW_HAS_SWITCH       (0)
#define MICROPY_HW_HAS_FLASH        (0)
#define MICROPY_HW_HAS_SDCARD       (0)
#define MICROPY_HW_HAS_MMA7660      (0)
#define MICROPY_HW_HAS_LIS3DSH      (0)
#define MICROPY_HW_HAS_LCD          (0)
#define MICROPY_HW_ENABLE_RNG       (0)
#define MICROPY_HW_ENABLE_RTC       (0)
#define MICROPY_HW_ENABLE_TIMER     (0)
#define MICROPY_HW_ENABLE_SERVO     (0)
#define MICROPY_HW_ENABLE_DAC       (0)
#define MICROPY_HW_ENABLE_CAN       (0)

#define MICROPY_PY_USOCKET          (1)
#define MICROPY_PY_NETWORK          (1)
#define MICROPY_PY_LTE_SOCKET       (1)
#define MICROPY_PY_USELECT_POSIX    (1)

#define MICROPY_HW_LED_COUNT        (3)
#define MICROPY_HW_LED_PULLUP       (0)

#define MICROPY_HW_LED1             (29) // RED
#define MICROPY_HW_LED2             (30) // GREEN
#define MICROPY_HW_LED3             (31) // BLUE

// UART config
// VCOM0
#define MICROPY_HW_UART1_RX         (19)
#define MICROPY_HW_UART1_TX         (18)
#define MICROPY_HW_UART1_CTS        (21)
#define MICROPY_HW_UART1_RTS        (20)
#define MICROPY_HW_UART1_HWFC       (1)

/*
// VCOM2
#define MICROPY_HW_UART1_RX         (23)
#define MICROPY_HW_UART1_TX         (22)
#define MICROPY_HW_UART1_CTS        (25)
#define MICROPY_HW_UART1_RTS        (24)
#define MICROPY_HW_UART1_HWFC       (0)
*/

// SPI0 config
#define MICROPY_HW_SPI0_NAME        "SPI0"

#define MICROPY_HW_SPI0_SCK         (3)
#define MICROPY_HW_SPI0_MOSI        (4)
#define MICROPY_HW_SPI0_MISO        (5)

#define HELP_TEXT_BOARD_LED         "1,2,3"
